$(document).ready(function() {
	$(document).on('change', '.js-contacts-select', function(){
		var selectVal = $(this).val();

		var contactPhones = {
			"Москва" : "+7 (495) 268-04-14",
			"Санкт-Петербург" : "+7 (812) 981-65-77",
			"Екатеринбург" : "+7 (343) 384-55-87",
			"Краснодар" : "+7 (861) 203-40-49",
			"Нижний Новгород" : "+7 (800) 777-05-32",
			"Ростов-на-Дону" : "+7 (800) 777-05-32",
			"Самара" : "+7 (800) 777-05-32",
			"Волгоград" : "+7 (800) 777-05-32",
			"Воронеж" : "+7 (800) 777-05-32",
			"Казань" : "+7 (800) 777-05-32",
			"Красноярск" : "+7 (800) 777-05-32",
			"Омск" : "+7 (800) 777-05-32",
			"Рязань" : "+7 (800) 777-05-32",
			"Саратов" : "+7 (800) 777-05-32",
			"Ставрополь" : "+7 (800) 777-05-32",
			"Тольятти" : "+7 (800) 777-05-32",
			"Тюмень" : "+7 (800) 777-05-32",
			"Уфа" : "+7 (800) 777-05-32",
			"Челябинск" : "+7 (800) 777-05-32",
			"Пермь" : "+7 (800) 777-05-32",
			"Сочи" : "+7 (800) 777-05-32",
			"Тула" : "+7 (800) 777-05-32",
		};

		if( contactPhones[selectVal] ) {
			$('.js-region-phone').text( contactPhones[selectVal] );
		} else {
			$('.js-region-phone').text( "+7 (800) 777-05-32" );
		}
	});

});